# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'fd'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'
brew 'imagemagick'
brew 'mas'
brew 'pkg-config' # Needed for imagemagick
brew 'trash'
brew 'tree'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Development
brew 'php@7.4'
brew 'node'
brew 'yarn'

# Apps
cask 'iterm2'
cask 'imageoptim'
cask 'clipy'
cask 'dropbox'
cask 'github'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'java'
cask 'now'
cask 'phpstorm'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'transmit'
cask 'vlc'
cask 'zeplin'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts (timed out last install)
#cask 'font-source-code-pro-for-powerline'
#cask 'font-source-code-pro'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'The Unarchiver', id: 425424353
mas 'BetterSnapTool', id: 417375580
mas 'The Unarchiver', id: 425424353
mas 'Harvest', id: 506189836
mas 'Sequel Ace', id:  1518036000
